       >>SOURCE FORMAT FREE

      identification division.
program-id. RemoveItem.
author. Marcos Santiago.
date-written. Diciembre 14 2023
environment division.
configuration section.
special-names.
data division.
file section.
       linkage section.
       
     
procedure division using .

exit program.